Repository: zipf/perldoc-es
Catalog: tm/work/perlspanish-omegat.explorer.tmx
Source language: en_us
Languages: es_es

# print "Writable " if -w _;
source: print "Writable\n" if -w _;
es_es: print "Escribible\n" if -w _;

source: The various named unary operators are treated as functions with one argument, with optional parentheses.
es_es: Los distintos operadores unarios con nombre son tratados como funciones con un argumento, con paréntesis opcionales.

source: See L<perlrun>.
es_es: Vea L<perlrun>.

source: Instead, it exits the current subroutine (losing any changes set by local()) and immediately calls in its place the named subroutine using the current value of @_.
es_es: En cambio, sale de la subrutina actual (perdiendo cualquier cambio hecho por local()) e inmediatamente llama a la subrutina indicada pasandole el valor actual de @_.

source: C<Digest::SHA> is a module used to calculate many types of SHA digests, has been included for SHA support in the CPAN module.
es_es: C<Digest::SHA> es un módulo usado para calcular cuántos tipos de resúmenes SHA, han sido incluidos para el soporte SHA en el módulo de CPAN.

source: Certain Perl core C APIs like cxinc and regatom are no longer available at all to code outside the Perl core of the Perl core extensions.
es_es: Ciertas API de C del núcleo de Perl, como cxinc y regatom ya no están disponibles en todo el código que esté fuera del núcleo principal de las extensiones de Perl.

source: The syntax for the C<-A> command-line switch has changed; it now accepts an optional module name, defaulting to C<assertions::activate>.
es_es: La sintaxis del comando C<-A> ha cambiado; ahora acepta un nombre de un módulo opcional, por defecto C<assertions::activate>.

source: A C</e> will cause the replacement portion to be treated as a full-fledged Perl expression and evaluated right then and there.
es_es: Un C</e> hará que la parte de reemplazo sea tratada como una verdadera expresión Perl y evaluada ahí y en ese mismo momento.

source: =item m X</m> X<regex, multiline> X<regexp, multiline> X<regular expression, multiline>
es_es: =item m X</m> X<regex, multiline> X<regexp, multiline> X<regular expression, multiline> X<regex, multilínea> X<expresión regular, multilínea>

source: Equivalent to C<< (?<NAME>pattern) >>.
es_es: Equivalente a C<< (?<NOMBRE>patrón) >>.

source: This contains instructions on how to build perl for the Haiku platform.
es_es: Contiene instrucciones para compilar perl para la plataforma Haiku.

source: C<File::Spec->rootdir()> now returns C<\> on Win32, instead of C</>
es_es: C<File::Spec->rootdir()> ahora devuelve C<\> en Win32, en lugar de C</>

source: C<++> behaves as the other operators above, except that if it is a string matching the format C</^[a-zA-Z]*[0-9]*\z/> the string increment described in L<perlop> is used.
es_es: C<++> se comporta como los operadores anteriores, con la diferencia de que si se aplica a una cadena que tenga el formato C</^[a-zA-Z]*[0-9]*\z/>, se usa el incremento de cadena descrito en L<perlop>.

source: =item dump LABEL X<dump> X<core> X<undump>
es_es: =item dump ETIQUETA X<dump> X<core> X<undump> X<volcado> X<núcleo>

source: Note that pod translators should look at only paragraphs beginning with a pod directive (it makes parsing easier), whereas the compiler actually knows to look for pod escapes even in the middle of a paragraph.
es_es: Note que los traductores pod suelen mirar sólo en los párrafos que comiencen por una directiva pod (hace el parseo más fácil), mientras que el compilador realmente sabe mirar por las secuencias pod incluso en el medio de un párrafo.

source: If non-empty braces are the only wildcard characters used in the C<glob>, no filenames are matched, but potentially many strings are returned.
es_es: Si los únicos caracteres comodín en C<glob> son llaves, no se coincidirá con ningún archivo, pero, potencialmente, se devuelven muchas cadenas.

source: To get status info for a symbolic link instead of the target file behind the link, use the C<lstat> function.
es_es: Para obtener información de estado de un enlace simbólico en lugar del archivo de destino tras el enlace, utilice la función C<lstat>.

source: The deprecated C<$#> variable (output format for numbers) has been removed.
es_es: La variable obsoleta C<$#> (formato de salida para los números) se ha eliminado.

source: rename any non-standard executables so the names do not conflict with standard executables, which must also be provided, and provide a separate manual page for each non-standard executable that clearly documents how it differs from the Standard Version.
es_es: cambie el nombre de cualquier ejecutable no estándar para que los nombres no entren en conflicto con los ejecutables estándar, que también se debe proporcionar, y proporcionar una página de manual por separado por cada ejecutable no estándar que documente claramente en qué se diferencia de la versión estándar.

source: For example, if you say
es_es: Por ejemplo, si dice

source: Math::BigRat upgraded to version 0.13
es_es: Math::BigRat actualizado a la versión 0.13

source: except that the block is automatically broken out of by a successful C<when> or an explicit C<break>.
es_es: excepto que el bloque es, automáticamente, parado, por un C<when> con éxito o un explícito C<break>.

source: This means that it short-circuits: the right expression is evaluated only if the left expression is true.
es_es: Esto significa que cortocircuita: es decir, la expresión de la derecha sólo se evalúa si la expresión de la izquierda es verdadera.

source: This is called an "array slice".
es_es: Esto se denomina una "porción de array".

source: The Road goes ever on and on,
es_es: El camino sigue y sigue,

source: However, long experience has shown that many programming tasks may be significantly simplified by using repeated subexpressions that may match zero-length substrings.
es_es: Sin embargo, la experiencia ha demostrado que muchas de las tareas de programación se pueden simplificar considerablemente mediante el uso de subexpresiones repetidas que coincidan con subcadenas de longitud cero.

source: The C<L<use re 'E<sol>foo'|re/'E<sol>flags' mode">> pragma can be used to set default modifiers (including these) for regular expressions compiled within its scope.
es_es: El pragma C<L<use re 'E<sol>foo'|re/'Banderas E<sol>'">> se puede utilizar para establecer los modificadores por defecto (incluyendo éstos) para las expresiones regulares compiladas dentro de su ámbito.

source: These include ExtUtils::ModuleMaker and h2xs.
es_es: Estos incluyen ExtUtils::ModuleMaker y h2xs.

source: When invoked as F<psed>, it behaves as a F<sed> implementation, written in Perl.
es_es: Cuando se invoca como F<psed>, se comporta como una implementación de F<sed> escrita en Perl.

source: =item Otherwise:
es_es: =item De lo contrario:

source: Return the positive square root of EXPR.
es_es: Devuelve la raíz cuadrada positiva de EXPR.

source: Package names are sometimes an exception to this rule.
es_es: Los nombres de los paquetes son, en alguna ocasión, una excepción a esta regla.

source: The same template may generally also be used in unpack().
es_es: La misma plantilla puede ser usada, generalmente, con unpack().

source: Although Perl has promised since version 5.8 that C<sort()> would be stable, the two cases C<sort {$b cmp $a}> and C<< sort {$b <=> $a} >> could produce non-stable sorts.
es_es: Aunque Perl prometió, desde la versión 5.8, que C<sort()> sería estable, los dos casos C<sort {$b cmp $a}> y C<< sort {$b <=> $a} >> puede producir ordenaciones no estables.

source: kill 9, @goners;
es_es: kill 9, @finalizadores;

source: $s = q{ if($a eq "}") ... }; # WRONG
es_es: $s = q{ if($a eq "}") ... }; # MAL

source: Note that if there were a C<continue> block on the above code, it would get executed only on lines discarded by the regex (since redo skips the continue block).
es_es: Note que si existiese un bloque C<continue> en este código, sería ejecutado sólo en las líneas descartadas por la expresión regular (debido a que C<redo> salta el bloque C<continue>).

source: =head2 Language-Specific
es_es: =head2 Idiomas específicos

source: Your module should include documentation aimed at Perl developers.
es_es: Su módulo debe incluir la documentación dirigida a los desarrolladores de Perl.

source: =head1 DOCUMENTING YOUR MODULE
es_es: =head1 DOCUMENTANDO SU MÓDULO

source: Several groups devoted to the Perl language are on Usenet:
es_es: En Usenet existen varios grupos dedicados al lenguaje Perl:

source: Furthermore, Perl inspects the operands of the binary boolean operators to decide whether to use smart matching for each one by applying the above test to the operands:
es_es: Además, Perl inspecciona los operandos de los operadores booleanos binarios para decidir si se debe usar coincidencia inteligente para cada uno de ellos mediante la aplicación de la prueba anterior a los operandos:

source: The most important Perl parsing rule is the first one discussed below: when processing a quoted construct, Perl first finds the end of that construct, then interprets its contents.
es_es: La más importante regla de análisis de Perl es la primera que se explica a continuación: cuando se procesa una construcción entrecomillada, Perl primero encuentra al final de esa construcción; a continuación, interpreta su contenido.

source: Make perl executable and create a symlink for libperl:
es_es: Hace a perl ejecutable y crea un enlace simbólico para libperl:

source: If you want to build a Perl with flock() support, you have to install this package first.
es_es: Si quiere construir un Perl con soporte de flock(), tiene que instalar este paquete en primer lugar.

source: For functions that can be used in either a scalar or list context, nonabortive failure is generally indicated in scalar context by returning the undefined value, and in list context by returning the empty list.
es_es: Para funciones que pueden ser usadas tanto en contexto escalar como en contexto de lista, un error no abortivo es indicado, generalmente, por un valor indefinido en el contexto escalar, y en contexto lista por una lista vacía.

source: Here's how to do one operation using a loop.
es_es: Aquí está cómo hacer una operación con un bucle.

source: So your build will fail if you choose the defaults.
es_es: Así que su compilación producirá un error si usted elige los valores predeterminados.

source: Characters special to the RE engine (such as C<|>) generate corresponding nodes or groups of nodes.
es_es: Caracteres especiales al motor de RE (como C<|>) generan sus correspondientes nodos o grupos de nodos.

source: A function C<again> is provided to resolve problems where modules in different directories wish to use FindBin.
es_es: Se proporciona, C<de nuevo>, una función para resolver los problemas donde módulos en diferentes directorios desean utilizar FindBin.

source: The hints files have been updated.
es_es: Los archivos de pistas han sido actualizados.

source: perlutil - utilities packaged with the Perl distribution
es_es: perlutil - Utilidades incluidas en la distribución de Perl

source: Here's some of the thing you'll find in it:
es_es: Contiene cosas como:

source: (A I<stable> sort preserves the input order of elements that compare equal.
es_es: (Un sort I<estable> preserva el orden de los elementos de entrada que sean iguales en la comparación.

source: See L<perlfunc/require> for details.
es_es: Vea L<perlfunc/require> para más detalles.

source: Here's another way to check for sentences in a paragraph:
es_es: Aquí hay otra forma de buscar sentencias en un párrafo:

source: If you are using such a module, see the module's documentation for details of the syntax that it defines.
es_es: Si está usando un módulo así, mire la documentación del módulo para ver los detalles de la sintaxis que define.

source: =head2 Single-number v-strings are no longer v-strings before "=>"
es_es: =head2 Las cadenas v-strings de un solo dígito ya no son v-strings delante de un "=>"

source: Rebuilt to be compatible with mod_perl.
es_es: Reconstruido para ser compatible con mod_perl.

source: If you are still reading this and you are itching to try out microperl:
es_es: Si aún sigue leyendo esto y está ansioso por probar microperl:

source: 0 dev 0 second 0 package $_ default variable
es_es: 0 dev 0 segundo 0 paquete $_ variable predeterminada

source: =item our TYPE EXPR
es_es: =item our TIPO EXPR

source: =head1 Configuration and Building
es_es: =head1 Configuración y construcción

source: perlboot Perl OO tutorial for beginners
es_es: perlboot Programación orientada a objetos para principiantes

# die $@ unless $@ eq "Alarm! ";
source: die $@ unless $@ eq "Alarm!\n";
es_es: die $@ unless $@ eq "¡Alarma!\n";

source: C<-lnet> is needed on net server systems only and if the compiler doesn't add it automatically (Be's R5 gcc does, Oliver Tappe's gcc 2.95.3 does not).
es_es: C<-lnet> es necesario en los sistemas net server solo si el compilador no lo agrega de forma automática (El gcc de Be R5 así lo hace; el gcc de Oliver Tappe 2.95.3, no).

source: printf '<%.1f>', 1; # prints "<1.0>"
es_es: printf '<%.1f>', 1; # imprime "<1.0>"

source: See also L</use>, L<perlmod>, and L<Exporter>.
es_es: Ver también L</use>, L<perlmod> y L<Exporter>.

source: Similarly, \xI<nn>, where I<nn> are hexadecimal digits, matches the character whose ordinal is I<nn>.
es_es: Del mismo modo, \xI<nn>, donde I<nn> son dígitos hexadecimales, coincide con el carácter cuyo ordinal es I<nn>.

source: If the PATTERN contains parentheses, additional list elements are created from each matching substring in the delimiter.
es_es: Si el PATRÓN contiene paréntesis, se crean elementos de lista adicionales por cada subcadena coincidente con el delimitador.

source: TEST_JOBS=3 make test_harness # Run 3 tests in parallel
es_es: TEST_JOBS=3 make test_harness # Ejecuta 3 test en paralelo

source: An example:
es_es: Un ejemplo:

source: Salvador FandiÃ±o provided improvements to reduce the memory usage of C<sort> and to speed up some cases.
es_es: Salvador Fandiño proporcionó mejoras para reducir la memoria usada por C<sort> y para mejorar la velocidad en algunos casos.

source: C<Digest::MD5> upgraded to version 2.36
es_es: C<Digest::MD5> actualizado a la versión 2.36

source: =item read FILEHANDLE,SCALAR,LENGTH,OFFSET X<read> X<file, read>
es_es: =item read IDENTIFICADOR_ARCHIVO,ESCALAR,LONGITUD,DESPLAZAMIENTO X<read> X<file, read> X<archivo, leer>

source: To determine if a module came with your version of Perl, you can use the C<Module::CoreList> module.
es_es: Para determinar si un módulo está incluido en su versión de Perl, puede usar C<Module::CoreList>.

source: While C<use integer> provides integer-only arithmetic, there is no analogous mechanism to provide automatic rounding or truncation to a certain number of decimal places.
es_es: Mientras que C<use integer> sólo proporciona aritmética de enteros, no existe un mecanismo análogo para proporcionar redondeo automático o truncamiento a un determinado número de decimales.

source: This includes turning off possible CRLF translation and marking it as bytes (as opposed to Unicode characters).
es_es: Esto incluye desactivar posibles traducciones CRLF y marcarlas como bytes (como opuesto a los caracteres Unicode).

source: =item On EBCDIC platforms
es_es: =item En plataformas EBCDIC

source: So C<given(@foo)> is the same as C<given(\@foo)>, for example.
es_es: Asi que, por ejemplo, C<given(@foo)> es lo mismo que C<given(\@foo)>.

source: Then use it like:
es_es: Puede asignar el valor devuelto así:

source: The tutorial started in the Llama continues in the Alpaca, which introduces the intermediate features of references, data structures, object-oriented programming, and modules:
es_es: El tutorial iniciado en el Libro de la Llama continúa en el Libro de la Alpaca, que presenta material de nivel intermedio, como referencias, estructuras de datos, programación orientada a objetos y módulos:

source: =head2 Matching repetitions
es_es: =head2 Coincidiendo con repeticiones

source: Details are in L<perlop/Quote and Quote-like Operators>.
es_es: Los detalles están en L<perlop/Comillas y Operadores de comillas>.

source: Opens the file whose filename is given by EXPR, and associates it with FILEHANDLE.
es_es: Abre el archivo cuyo nombre viene dado por EXPR, y lo asocia con IDENTIFICADOR_ARCHIVO.

source: A compound expression involving the defined-or operator, as in C<when (expr1 // expr2)>, will be treated as boolean if the first expression is boolean.
es_es: Una expresión compuesta, que incluya al operador definido-or, como en C<when (expr1 // expr2)>, será tratada como booleana si la primera expresión es booleana.

source: foreach my $pat (@compiled) {
es_es: foreach my $pat (@compilados) {

source: =item C<(?:pattern)> X<(?:)>
es_es: =item C<(?:patrón)> X<(?:)>

source: To view the differences between the 5.7.0 release and the 5.7.1 release, see L<perl571delta>.
es_es: (Para ver las diferencias entre la versión 5.7.0 y la versión 5.7.1, vea L<perl571delta>.

source: open(FOO) ? 'hi mom' : die "Can't open $FOO: $!";
es_es: open(FOO) ? 'hola mamá' : die "No puedo abrir $FOO: $!";

source: Using "or" for assignment is unlikely to do what you want; see below.
es_es: Es poco probable que quiera usar "or" para hacer asignaciones; vea más adelante.

source: It still counts as scalar context for functions that care whether or not they're being called in list context.
es_es: Además, también cuenta como contexto escalar para las funciones a las que les interesa saber si han sido llamadas en contexto lista o no.

source: Note that although the warning says the illegal character is ignored, it is only ignored as part of the escape and will still be used as the subsequent character in the string.
es_es: Tenga en cuenta que, si bien la advertencia dice que el carácter ilegal no se tiene en cuenta, sólo es ignorado como parte del escapado y aún así es utilizado como el carácter siguiente en la cadena.

source: There is a list of these books, some with extensive reviews, at http://books.perl.org/ . We list some of the books here, and while listing a book implies our endorsement, don't think that not including a book means anything.
es_es: En http://books.perl.org/ encontrará una lista de libros y extensas reseñas. En este documento se hace referencia a algunos de estos libros. Los que figuran en la lista son libros que recomendamos; no obstante, el que un libro no figure en la lista no quiere decir que sea malo.

source: Throughout this document you'll see references to other parts of the Perl documentation.
es_es: En este documento se incluyen referencias a otras partes de la documentación de Perl.

source: X<~> X<negation, binary>
es_es: X<~> X<negation, binary> X<negación, binario>

source: perlcheat has been added: it is a Perl cheat sheet.
es_es: perlcheat ha sido añadida: se trata de una hoja de trucos Perl.

source: New C<-noperldoc> switch for C<pod2usage>
es_es: Nueva opción C<-noperldoc> para C<pod2usage>

source: Once upon a time, Perl would recompile regular expressions unnecessarily, and this modifier was useful to tell it not to do so, in the interests of speed.
es_es: Hace algún tiempo, Perl hubiera recompilado expresiones regulares innecesariamente, y este modificador era útil para decirle que no lo hiciese, en aras de aumentar la velocidad.

source: =item pack TEMPLATE,LIST X<pack>
es_es: =item pack PLANTILLA,LISTA X<pack>

source: C<chdir>, C<chmod> and C<chown> can now work on filehandles as well as filenames, if the system supports respectively C<fchdir>, C<fchmod> and C<fchown>, thanks to a patch provided by Gisle Aas.
es_es: C<chdir>, C<chmod> y C<chown> ahora pueden trabajar tanto con nombres de ficheros como con identificadores de archivos, si el sistema soporta, respectivamente, C<fchdir>, C<fchmod> y C<fchown>, gracias a un parche proporcionado por Gisle Aas.

source: That means that if you're in the C<main> package and type
es_es: Esto significa que si usted está en el paquete C<main> y escribe

source: instead of having to write these:
es_es: en lugar de tener que escribir lo siguiente?

source: The port of Perl to to Mac OS was officially removed as of Perl 5.12, though the last official production release of MacPerl corresponded to Perl 5.6.
es_es: La versión de Perl para el Mac OS se retiró oficialmente como Perl 5.12, aunque el lanzamiento oficial de la última versión de producción MacPerl correspondió a Perl 5.6.

source: =head3 Quantifiers
es_es: =head3 Cuantificadores

source: As well as grouping, parentheses serve a second purpose.
es_es: Además de para agrupar, los paréntesis también

source: This pattern matches nothing and causes the end of successful matching at the point at which the C<(*ACCEPT)> pattern was encountered, regardless of whether there is actually more to match in the string.
es_es: Este patrón no coincide con nada y provoca el final de una coincidencia con éxito en el lugar en que el patrón C<(*ACCEPT)> se encontraba, sin importar si pudiera haber más coincidencias en la cadena.

source: as though the argument to C<given> were an element of the hash C<%foo>, interpreting the braces as hash-element syntax.
es_es: como si el argumento a C<given> fuera un elemento del hash C<%foo>, interpretando las llaves como la sintaxis de un elemento de un hash.

source: they'll be politely informed that
es_es: va a ser cortésmente informado de que

source: system "echo $temp";
es_es: system "echo $temporal";

source: It collects information about your installation to include with your message, then sends the message to the right place.
es_es: Esta utilidad recopila información sobre la instalación para incluirla en el mensaje y después envía el informe a la dirección adecuada.

source: print if $printit;
es_es: print if $imprimir;

source: Characters may be specified using a metacharacter syntax much like that used in C: "\n" matches a newline, "\t" a tab, "\r" a carriage return, "\f" a form feed, etc. More generally, \I<nnn>, where I<nnn> is a string of three octal digits, matches the character whose coded character set value is I<nnn>.
es_es: Los caracteres pueden ser especificados utilizando una sintaxis metacarácter al igual que la utilizada en C: "\n" coincide con un nueva línea, "\t" un tabulador, "\r" un retorno de carro, "\f" un avance de página, etc. En términos más generales, \I<nnn>, donde I<nnn> es una cadena de tres dígitos octales, coincide con el carácter cuyo código de valor del conjunto de caracteres es I<nnn>.

source: C<Digest> upgraded to version 1.14
es_es: C<Digest> actualizado a la versión 1.14

source: The C<code> is properly scoped in the following sense: If the assertion is backtracked (compare L<"Backtracking">), all changes introduced after C<local>ization are undone, so that
es_es: El C<código> está apropiadamente encerrado en un ámbito, en el sentido siguiente: si la aserción es retrotraída (comparar con L<"Retrotraer">), todos los cambios introducidos después de la C<local>ización son deshechos, por lo que

source: This would be clearer to the casual reader:
es_es: Esto será más claro para el lector casual:

source: are also always exempt from such warnings.
es_es: están también exentos de tales avisos.

source: s/\d+/sprintf("%5d",$&)/e; # yields 'abc 246xyz'
es_es: s/\d+/sprintf("%5d",$&)/e; # queda como 'abc 246xyz'

source: C<$scalar ~~ @array> now always distributes the smart match across the elements of the array.
es_es: C<$scalar ~~ @array> ahora siempre distribuye la coincidencia inteligente a lo largo de todos los elementos del array.

source: perlfreebsd Perl notes for FreeBSD
es_es: perlfreebsd Notas para FreeBSD
